--http://dev.mysql.com/doc/refman/5.1/en/se-db2.html
Механизм хранения IBMDB2I предназначен как полнофункциональный сделки с поддержкой механизма хранения, что позволяет MySQL  сохранять данные в таблицах DB2, работающих на IBMDB2I. С механизмом хранения IBMDB2I, данные могут быть разделены между приложениями MySQL и приложений кодом для родных DB2 для интерфейсов.

IBMDB2I предоставляет ACID-совместимых транзакций, поддержку внешних ключей, полное восстановление после сбоев, индексы "корень дерева", а также уникальная возможность включения DB2 для приложений видеть и обновлять данные таблицы в режиме реального времени.
